Path doesn't join to border risers is not allowed.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PathDoesntJoinToBorderRisersFailure { get; }
  Visual Basic
Public Shared ReadOnly Property PathDoesntJoinToBorderRisersFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PathDoesntJoinToBorderRisersFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace